packages/rust-axum/results.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ../../script.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 43s max duration (incl. graceful stop):
              * delayed_start: 10 looping VUs for 10s (startTime: 3s, gracefulStop: 30s)


running (01.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  2.0s

running (02.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  1.0s

running (03.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  0.0s

running (04.0s), 10/10 VUs, 11289 complete and 0 interrupted iterations
delayed_start   [  10% ] 10 VUs  01.0s/10s

running (05.0s), 10/10 VUs, 22596 complete and 0 interrupted iterations
delayed_start   [  20% ] 10 VUs  02.0s/10s

running (06.0s), 10/10 VUs, 33822 complete and 0 interrupted iterations
delayed_start   [  30% ] 10 VUs  03.0s/10s

running (07.0s), 10/10 VUs, 46101 complete and 0 interrupted iterations
delayed_start   [  40% ] 10 VUs  04.0s/10s

running (08.0s), 10/10 VUs, 56376 complete and 0 interrupted iterations
delayed_start   [  50% ] 10 VUs  05.0s/10s

running (09.0s), 10/10 VUs, 67338 complete and 0 interrupted iterations
delayed_start   [  60% ] 10 VUs  06.0s/10s

running (10.0s), 10/10 VUs, 79018 complete and 0 interrupted iterations
delayed_start   [  70% ] 10 VUs  07.0s/10s

running (11.0s), 10/10 VUs, 88180 complete and 0 interrupted iterations
delayed_start   [  80% ] 10 VUs  08.0s/10s

running (12.0s), 10/10 VUs, 99352 complete and 0 interrupted iterations
delayed_start   [  90% ] 10 VUs  09.0s/10s

running (13.0s), 04/10 VUs, 112015 complete and 0 interrupted iterations
delayed_start ↓ [ 100% ] 10 VUs  10s

     data_received..................: 72 MB  5.5 MB/s
     data_sent......................: 9.0 MB 689 kB/s
     http_req_blocked...............: avg=1.9µs    min=601ns    med=1.37µs   max=5.4ms    p(90)=1.77µs  p(95)=2.09µs 
     http_req_connecting............: avg=39ns     min=0s       med=0s       max=859.06µs p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=838.89µs min=72.02µs  med=611.36µs max=33.85ms  p(90)=1.62ms  p(95)=2.23ms 
       { expected_response:true }...: avg=838.89µs min=72.02µs  med=611.36µs max=33.85ms  p(90)=1.62ms  p(95)=2.23ms 
     http_req_failed................: 0.00%  ✓ 0           ✗ 112019
     http_req_receiving.............: avg=36.35µs  min=8.71µs   med=16.58µs  max=20.92ms  p(90)=63.22µs p(95)=66.52µs
     http_req_sending...............: avg=13.01µs  min=2.75µs   med=5.82µs   max=10.88ms  p(90)=8.09µs  p(95)=10.45µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=789.51µs min=48.56µs  med=573.09µs max=33.82ms  p(90)=1.55ms  p(95)=2.12ms 
     http_reqs......................: 112019 8606.011556/s
     iteration_duration.............: avg=882.48µs min=105.67µs med=649.96µs max=33.89ms  p(90)=1.67ms  p(95)=2.29ms 
     iterations.....................: 112019 8606.011556/s
     vus............................: 10     min=0         max=10  
     vus_max........................: 10     min=10        max=10  


running (13.0s), 00/10 VUs, 112019 complete and 0 interrupted iterations
delayed_start ✓ [ 100% ] 10 VUs  10s