packages/rust-axum/results.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ../../script.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 43s max duration (incl. graceful stop):
              * delayed_start: 10 looping VUs for 10s (startTime: 3s, gracefulStop: 30s)


running (01.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  2.0s

running (02.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  1.0s

running (03.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  0.0s

running (04.0s), 10/10 VUs, 65498 complete and 0 interrupted iterations
delayed_start   [  10% ] 10 VUs  01.0s/10s

running (05.0s), 10/10 VUs, 136167 complete and 0 interrupted iterations
delayed_start   [  20% ] 10 VUs  02.0s/10s

running (06.0s), 10/10 VUs, 206303 complete and 0 interrupted iterations
delayed_start   [  30% ] 10 VUs  03.0s/10s

running (07.0s), 10/10 VUs, 274275 complete and 0 interrupted iterations
delayed_start   [  40% ] 10 VUs  04.0s/10s

running (08.0s), 10/10 VUs, 348751 complete and 0 interrupted iterations
delayed_start   [  50% ] 10 VUs  05.0s/10s

running (09.0s), 10/10 VUs, 425097 complete and 0 interrupted iterations
delayed_start   [  60% ] 10 VUs  06.0s/10s

running (10.0s), 10/10 VUs, 504247 complete and 0 interrupted iterations
delayed_start   [  70% ] 10 VUs  07.0s/10s

running (11.0s), 10/10 VUs, 582338 complete and 0 interrupted iterations
delayed_start   [  80% ] 10 VUs  08.0s/10s

running (12.0s), 10/10 VUs, 659764 complete and 0 interrupted iterations
delayed_start   [  90% ] 10 VUs  09.0s/10s

running (13.0s), 10/10 VUs, 735713 complete and 0 interrupted iterations
delayed_start   [ 100% ] 10 VUs  10.0s/10s

     data_received..................: 472 MB 36 MB/s
     data_sent......................: 59 MB  4.5 MB/s
     http_req_blocked...............: avg=1.09µs   min=0s      med=0s      max=39.72ms  p(90)=1µs      p(95)=1µs     
     http_req_connecting............: avg=8ns      min=0s      med=0s      max=1.14ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=108.55µs min=24µs    med=76µs    max=65.36ms  p(90)=170µs    p(95)=222µs   
       { expected_response:true }...: avg=108.55µs min=24µs    med=76µs    max=65.36ms  p(90)=170µs    p(95)=222µs   
     http_req_failed................: 0.00%  ✓ 0            ✗ 735842
     http_req_receiving.............: avg=13.62µs  min=3µs     med=4µs     max=52.54ms  p(90)=11µs     p(95)=20µs    
     http_req_sending...............: avg=4.39µs   min=1µs     med=2µs     max=49.4ms   p(90)=3µs      p(95)=8µs     
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=90.54µs  min=19µs    med=67µs    max=65.24ms  p(90)=155µs    p(95)=201µs   
     http_reqs......................: 735842 56600.775166/s
     iteration_duration.............: avg=130.67µs min=30.45µs med=89.04µs max=134.06ms p(90)=190.62µs p(95)=251.08µs
     iterations.....................: 735842 56600.775166/s
     vus............................: 10     min=0          max=10  
     vus_max........................: 10     min=10         max=10  


running (13.0s), 00/10 VUs, 735842 complete and 0 interrupted iterations
delayed_start ✓ [ 100% ] 10 VUs  10s